iarsystems/ewarm-toshiba-example-projects/TMPM344/Libraries/TX03_CMSIS/startup/iar/startup_TMPM344.s
                PUBWEAK UsageFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
                B       UsageFault_Handler

                PUBWEAK SVC_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
                B       SVC_Handler

                PUBWEAK DebugMon_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
                B       DebugMon_Handler

                PUBWEAK PendSV_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
                B       PendSV_Handler

                PUBWEAK SysTick_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
                B       SysTick_Handler

                PUBWEAK INT0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT0_IRQHandler
                B       INT0_IRQHandler

                PUBWEAK INT1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT1_IRQHandler
                B       INT1_IRQHandler

                PUBWEAK INT2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT2_IRQHandler
                B       INT2_IRQHandler

                PUBWEAK INT3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT3_IRQHandler
                B       INT3_IRQHandler

                PUBWEAK INT4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT4_IRQHandler
                B       INT4_IRQHandler

                PUBWEAK INT5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT5_IRQHandler
                B       INT5_IRQHandler

                PUBWEAK INT6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT6_IRQHandler
                B       INT6_IRQHandler

                PUBWEAK INT7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT7_IRQHandler
                B       INT7_IRQHandler

                PUBWEAK INT8_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT8_IRQHandler
                B       INT8_IRQHandler

                PUBWEAK INT9_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT9_IRQHandler
                B       INT9_IRQHandler

                PUBWEAK INTA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTA_IRQHandler
                B       INTA_IRQHandler

                PUBWEAK INTB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTB_IRQHandler
                B       INTB_IRQHandler

                PUBWEAK INTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTC_IRQHandler
                B       INTC_IRQHandler

                PUBWEAK INTD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTD_IRQHandler
                B       INTD_IRQHandler

                PUBWEAK INTE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTE_IRQHandler
                B       INTE_IRQHandler

                PUBWEAK INTF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTF_IRQHandler
                B       INTF_IRQHandler

                PUBWEAK INTPSCASTOP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCASTOP_IRQHandler
                B       INTPSCASTOP_IRQHandler

                PUBWEAK INTPSCABRK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCABRK_IRQHandler
                B       INTPSCABRK_IRQHandler

                PUBWEAK INTPSCASTEP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCASTEP_IRQHandler
                B       INTPSCASTEP_IRQHandler

                PUBWEAK INTPSCAII_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCAII_IRQHandler
                B       INTPSCAII_IRQHandler

                PUBWEAK INTPSCAIA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCAIA_IRQHandler
                B       INTPSCAIA_IRQHandler

                PUBWEAK INTPSCBSTOP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCBSTOP_IRQHandler
                B       INTPSCBSTOP_IRQHandler

                PUBWEAK INTPSCBBRK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCBBRK_IRQHandler
                B       INTPSCBBRK_IRQHandler

                PUBWEAK INTPSCBSTEP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCBSTEP_IRQHandler
                B       INTPSCBSTEP_IRQHandler

                PUBWEAK INTPSCBII_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCBII_IRQHandler
                B       INTPSCBII_IRQHandler

                PUBWEAK INTPSCBIA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCBIA_IRQHandler
                B       INTPSCBIA_IRQHandler

                PUBWEAK INTPSCCSTOP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCCSTOP_IRQHandler
                B       INTPSCCSTOP_IRQHandler

                PUBWEAK INTPSCCBRK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCCBRK_IRQHandler
                B       INTPSCCBRK_IRQHandler

                PUBWEAK INTPSCCSTEP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCCSTEP_IRQHandler
                B       INTPSCCSTEP_IRQHandler

                PUBWEAK INTPSCCII_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCCII_IRQHandler
                B       INTPSCCII_IRQHandler

                PUBWEAK INTPSCCIA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCCIA_IRQHandler
                B       INTPSCCIA_IRQHandler

                PUBWEAK INTPSCDSTOP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCDSTOP_IRQHandler
                B       INTPSCDSTOP_IRQHandler

                PUBWEAK INTPSCDBRK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCDBRK_IRQHandler
                B       INTPSCDBRK_IRQHandler

