iarsystems/ewarm-toshiba-example-projects/TMPM344/Libraries/TX03_CMSIS/startup/iar/startup_TMPM344.s
                PUBWEAK INTPSCDSTEP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCDSTEP_IRQHandler
                B       INTPSCDSTEP_IRQHandler

                PUBWEAK INTPSCDII_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCDII_IRQHandler
                B       INTPSCDII_IRQHandler

                PUBWEAK INTPSCDIA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPSCDIA_IRQHandler
                B       INTPSCDIA_IRQHandler

                PUBWEAK INTT0RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT0RX_IRQHandler
                B       INTT0RX_IRQHandler

                PUBWEAK INTT0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT0TX_IRQHandler
                B       INTT0TX_IRQHandler

                PUBWEAK INTT0ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT0ERR_IRQHandler
                B       INTT0ERR_IRQHandler

                PUBWEAK INTT1RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT1RX_IRQHandler
                B       INTT1RX_IRQHandler

                PUBWEAK INTT1TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT1TX_IRQHandler
                B       INTT1TX_IRQHandler

                PUBWEAK INTT1ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT1ERR_IRQHandler
                B       INTT1ERR_IRQHandler

                PUBWEAK INTT2RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT2RX_IRQHandler
                B       INTT2RX_IRQHandler

                PUBWEAK INTT2TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT2TX_IRQHandler
                B       INTT2TX_IRQHandler

                PUBWEAK INTT2ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT2ERR_IRQHandler
                B       INTT2ERR_IRQHandler

                PUBWEAK INTT3RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT3RX_IRQHandler
                B       INTT3RX_IRQHandler

                PUBWEAK INTT3TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT3TX_IRQHandler
                B       INTT3TX_IRQHandler

                PUBWEAK INTT3ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT3ERR_IRQHandler
                B       INTT3ERR_IRQHandler

                PUBWEAK INTT4RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT4RX_IRQHandler
                B       INTT4RX_IRQHandler

                PUBWEAK INTT4TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT4TX_IRQHandler
                B       INTT4TX_IRQHandler

                PUBWEAK INTT4ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT4ERR_IRQHandler
                B       INTT4ERR_IRQHandler

                PUBWEAK INTUART0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART0_IRQHandler
                B       INTUART0_IRQHandler

                PUBWEAK INTRX0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRX0_IRQHandler
                B       INTRX0_IRQHandler

                PUBWEAK INTTX0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTX0_IRQHandler
                B       INTTX0_IRQHandler

                PUBWEAK INTI2C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C_IRQHandler
                B       INTI2C_IRQHandler

                PUBWEAK INTADA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADA_IRQHandler
                B       INTADA_IRQHandler

                PUBWEAK INTADB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADB_IRQHandler
                B       INTADB_IRQHandler

                PUBWEAK INTADC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADC_IRQHandler
                B       INTADC_IRQHandler

                PUBWEAK INTADAHP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADAHP_IRQHandler
                B       INTADAHP_IRQHandler

                PUBWEAK INTADBHP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBHP_IRQHandler
                B       INTADBHP_IRQHandler

                PUBWEAK INTADCHP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCHP_IRQHandler
                B       INTADCHP_IRQHandler

                PUBWEAK INTEPHC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEPHC0_IRQHandler
                B       INTEPHC0_IRQHandler

                PUBWEAK INTPHCP0OVF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP0OVF_IRQHandler
                B       INTPHCP0OVF_IRQHandler

                PUBWEAK INTPHCP0PHE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP0PHE_IRQHandler
                B       INTPHCP0PHE_IRQHandler

                PUBWEAK INTPHCP0CY0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP0CY0_IRQHandler
                B       INTPHCP0CY0_IRQHandler

                PUBWEAK INTPHCP0CY1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP0CY1_IRQHandler
                B       INTPHCP0CY1_IRQHandler

                PUBWEAK INTPHCP0CY2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP0CY2_IRQHandler
                B       INTPHCP0CY2_IRQHandler

                PUBWEAK INTPHCP0CY3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP0CY3_IRQHandler
                B       INTPHCP0CY3_IRQHandler

                PUBWEAK INTPHCP0LMT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP0LMT_IRQHandler
                B       INTPHCP0LMT_IRQHandler

                PUBWEAK INTEPHC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEPHC1_IRQHandler
                B       INTEPHC1_IRQHandler

