iarsystems/ewarm-toshiba-example-projects/TMPM344/Libraries/TX03_CMSIS/startup/iar/startup_TMPM344.s
                PUBWEAK INTPHCP1OVF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP1OVF_IRQHandler
                B       INTPHCP1OVF_IRQHandler

                PUBWEAK INTPHCP1PHE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP1PHE_IRQHandler
                B       INTPHCP1PHE_IRQHandler

                PUBWEAK INTPHCP1CY0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP1CY0_IRQHandler
                B       INTPHCP1CY0_IRQHandler

                PUBWEAK INTPHCP1CY1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP1CY1_IRQHandler
                B       INTPHCP1CY1_IRQHandler

                PUBWEAK INTPHCP1CY2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP1CY2_IRQHandler
                B       INTPHCP1CY2_IRQHandler

                PUBWEAK INTPHCP1CY3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP1CY3_IRQHandler
                B       INTPHCP1CY3_IRQHandler

                PUBWEAK INTPHCP1LMT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP1LMT_IRQHandler
                B       INTPHCP1LMT_IRQHandler

                PUBWEAK INTEPHC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEPHC2_IRQHandler
                B       INTEPHC2_IRQHandler

                PUBWEAK INTPHCP2OVF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP2OVF_IRQHandler
                B       INTPHCP2OVF_IRQHandler

                PUBWEAK INTPHCP2PHE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP2PHE_IRQHandler
                B       INTPHCP2PHE_IRQHandler

                PUBWEAK INTPHCP2CY0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP2CY0_IRQHandler
                B       INTPHCP2CY0_IRQHandler

                PUBWEAK INTPHCP2CY1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP2CY1_IRQHandler
                B       INTPHCP2CY1_IRQHandler

                PUBWEAK INTPHCP2CY2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP2CY2_IRQHandler
                B       INTPHCP2CY2_IRQHandler

                PUBWEAK INTPHCP2CY3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP2CY3_IRQHandler
                B       INTPHCP2CY3_IRQHandler

                PUBWEAK INTPHCP2LMT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPHCP2LMT_IRQHandler
                B       INTPHCP2LMT_IRQHandler

                PUBWEAK INTTDA0CMP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA0CMP0_IRQHandler
                B       INTTDA0CMP0_IRQHandler

                PUBWEAK INTTDA0CMP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA0CMP1_IRQHandler
                B       INTTDA0CMP1_IRQHandler

                PUBWEAK INTTDA0CMP2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA0CMP2_IRQHandler
                B       INTTDA0CMP2_IRQHandler

                PUBWEAK INTTDA0CMP3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA0CMP3_IRQHandler
                B       INTTDA0CMP3_IRQHandler

                PUBWEAK INTTDA0CMP4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA0CMP4_IRQHandler
                B       INTTDA0CMP4_IRQHandler

                PUBWEAK INTTDA1CMP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA1CMP0_IRQHandler
                B       INTTDA1CMP0_IRQHandler

                PUBWEAK INTTDA1CMP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA1CMP1_IRQHandler
                B       INTTDA1CMP1_IRQHandler

                PUBWEAK INTTDA1CMP2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA1CMP2_IRQHandler
                B       INTTDA1CMP2_IRQHandler

                PUBWEAK INTTDA1CMP3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA1CMP3_IRQHandler
                B       INTTDA1CMP3_IRQHandler

                PUBWEAK INTTDA1CMP4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDA1CMP4_IRQHandler
                B       INTTDA1CMP4_IRQHandler

                PUBWEAK INTTDB0CMP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB0CMP0_IRQHandler
                B       INTTDB0CMP0_IRQHandler

                PUBWEAK INTTDB0CMP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB0CMP1_IRQHandler
                B       INTTDB0CMP1_IRQHandler

                PUBWEAK INTTDB0CMP2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB0CMP2_IRQHandler
                B       INTTDB0CMP2_IRQHandler

                PUBWEAK INTTDB0CMP3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB0CMP3_IRQHandler
                B       INTTDB0CMP3_IRQHandler

                PUBWEAK INTTDB0CMP4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB0CMP4_IRQHandler
                B       INTTDB0CMP4_IRQHandler

                PUBWEAK INTTDB1CMP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB1CMP0_IRQHandler
                B       INTTDB1CMP0_IRQHandler

                PUBWEAK INTTDB1CMP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB1CMP1_IRQHandler
                B       INTTDB1CMP1_IRQHandler

                PUBWEAK INTTDB1CMP2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB1CMP2_IRQHandler
                B       INTTDB1CMP2_IRQHandler

                PUBWEAK INTTDB1CMP3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB1CMP3_IRQHandler
                B       INTTDB1CMP3_IRQHandler

                PUBWEAK INTTDB1CMP4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTDB1CMP4_IRQHandler
                B       INTTDB1CMP4_IRQHandler

                PUBWEAK INTTB0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB0_IRQHandler
                B       INTTB0_IRQHandler

