iarsystems/ewarm-toshiba-example-projects/TMPM344/Libraries/TX03_CMSIS/startup/iar/startup_TMPM344.s
                PUBWEAK INTTB1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB1_IRQHandler
                B       INTTB1_IRQHandler

                PUBWEAK INTTB2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB2_IRQHandler
                B       INTTB2_IRQHandler

                PUBWEAK INTTB3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB3_IRQHandler
                B       INTTB3_IRQHandler

                PUBWEAK INTTB4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB4_IRQHandler
                B       INTTB4_IRQHandler

                PUBWEAK INTTB5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB5_IRQHandler
                B       INTTB5_IRQHandler

                PUBWEAK INTTB6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB6_IRQHandler
                B       INTTB6_IRQHandler

                PUBWEAK INTTB7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB7_IRQHandler
                B       INTTB7_IRQHandler

                PUBWEAK INTTB8_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB8_IRQHandler
                B       INTTB8_IRQHandler

                PUBWEAK INTTB9_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB9_IRQHandler
                B       INTTB9_IRQHandler

                PUBWEAK INTTBA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBA_IRQHandler
                B       INTTBA_IRQHandler

                PUBWEAK INTTBB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBB_IRQHandler
                B       INTTBB_IRQHandler

                PUBWEAK INTTBC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBC_IRQHandler
                B       INTTBC_IRQHandler

                PUBWEAK INTTBD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBD_IRQHandler
                B       INTTBD_IRQHandler

                PUBWEAK INTTBE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBE_IRQHandler
                B       INTTBE_IRQHandler

                PUBWEAK INTTBF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBF_IRQHandler
                B       INTTBF_IRQHandler

                PUBWEAK INTTBCCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBCCAP0_IRQHandler
                B       INTTBCCAP0_IRQHandler

                PUBWEAK INTTBCCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBCCAP1_IRQHandler
                B       INTTBCCAP1_IRQHandler

                PUBWEAK INTTBDCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBDCAP0_IRQHandler
                B       INTTBDCAP0_IRQHandler

                PUBWEAK INTTBDCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBDCAP1_IRQHandler
                B       INTTBDCAP1_IRQHandler

                PUBWEAK INTTBECAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBECAP0_IRQHandler
                B       INTTBECAP0_IRQHandler

                PUBWEAK INTTBECAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBECAP1_IRQHandler
                B       INTTBECAP1_IRQHandler

                PUBWEAK INTTBFCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBFCAP0_IRQHandler
                B       INTTBFCAP0_IRQHandler

                PUBWEAK INTTBFCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTBFCAP1_IRQHandler
                B       INTTBFCAP1_IRQHandler

                PUBWEAK INTADAM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADAM0_IRQHandler
                B       INTADAM0_IRQHandler

                PUBWEAK INTADAM1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADAM1_IRQHandler
                B       INTADAM1_IRQHandler

                PUBWEAK INTADBM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBM0_IRQHandler
                B       INTADBM0_IRQHandler

                PUBWEAK INTADBM1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBM1_IRQHandler
                B       INTADBM1_IRQHandler

                PUBWEAK INTADCM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCM0_IRQHandler
                B       INTADCM0_IRQHandler

                PUBWEAK INTADCM1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCM1_IRQHandler
                B       INTADCM1_IRQHandler

                PUBWEAK INTDMACATC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACATC_IRQHandler
                B       INTDMACATC_IRQHandler

                PUBWEAK INTDMACAERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACAERR_IRQHandler
                B       INTDMACAERR_IRQHandler

                PUBWEAK INTDMACBTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACBTC_IRQHandler
                B       INTDMACBTC_IRQHandler

                PUBWEAK INTDMACBERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACBERR_IRQHandler
                B       INTDMACBERR_IRQHandler

                PUBWEAK INTDMACCTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACCTC_IRQHandler
                B       INTDMACCTC_IRQHandler

                PUBWEAK INTDMACCERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACCERR_IRQHandler
                B       INTDMACCERR_IRQHandler

                END
